Tekla Open API Reference for Tekla Structures 2025
CustomPartBase.Run Method
 The main method of the component. Inside Run the user can implement the logic based on the user given attributes and input. Inside the method input can be found from the provided properties: Primary, Secondaries and Positions.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract bool Run()
Public MustOverride Function Run As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
CustomPartBase Class
Tekla.Structures.Plugins Namespace